Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_integration.start_execution_integration will be updated in-place
~ resource "aws_api_gateway_integration" "start_execution_integration" {
        id                      = "agi-70paytfqfb-g6k3d8-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:825765422855:function:api-router/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.lambdas_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "lambdas_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Errors",
                                  + "FunctionName",
                                  + "render_video",
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + "FunctionName",
                                  + "notify_post",
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-2"
                          + stat    = "Sum"
                          + title   = "Lambda Errors"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Throttles",
                                  + "FunctionName",
                                  + "render_video",
                                ],
                              + [
                                  + ".",
                                  + "Throttles",
                                  + "FunctionName",
                                  + "notify_post",
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-2"
                          + stat    = "Sum"
                          + title   = "Lambda Throttles"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 0
                    },
                ]
            }
        )
      + dashboard_name = "LambdaDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_dashboard.step_functions_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "StepFunctionsDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.manual_workflow_failures will be created
+ resource "aws_cloudwatch_metric_alarm" "manual_workflow_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:825765422855:sharedservices-monitoring-topic",
        ]
      + alarm_description                     = "Alert if the manual Step Function fails within a 5-minute window."
      + alarm_name                            = "sharedservices-manual-workflow-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsFailed"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:825765422855:sharedservices-monitoring-topic",
        ]
      + alarm_description                     = "Alert if notify_post invocations deviate from normal"
      + alarm_name                            = "sharedservices-notify-post-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "NotifyPostInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "notify_post"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.render_video_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "render_video_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:825765422855:sharedservices-monitoring-topic",
        ]
      + alarm_description                     = "Alert if render_video invocations deviate from normal"
      + alarm_name                            = "sharedservices-render-video-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "RenderVideoInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "render_video"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_role_policy.lambda_sqs_send_message will be created
+ resource "aws_iam_role_policy" "lambda_sqs_send_message" {
      + id          = (known after apply)
      + name        = "sharedservices_lambda_sqs_send_message"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:GetQueueAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-2:825765422855:sharedservices-lambda-dlq",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_lambda_role"
    }

  # aws_iam_role_policy.step_functions_policy will be created
+ resource "aws_iam_role_policy" "step_functions_policy" {
      + id          = (known after apply)
      + name        = "sharedservices_step_functions_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sharedservices_step_functions_role"
    }

  # aws_iam_role_policy_attachment.lambda_sqs_send_message will be created
+ resource "aws_iam_role_policy_attachment" "lambda_sqs_send_message" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaSQSQueueExecutionRole"
      + role       = "sharedservices_lambda_role"
    }

  # aws_lambda_function.notify_post will be created
+ resource "aws_lambda_function" "notify_post" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/notify_post/notify_post.zip"
      + function_name                  = "notify_post"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:825765422855:layer:Python_Requests:1",
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "WcnSdEzALE3Cuvl7OhAVNer9j4hpLwrHQp0bnnqqoEk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = "arn:aws:sqs:us-east-2:825765422855:sharedservices-lambda-dlq"
        }

      + environment {
          + variables = {
              + "TARGET_BUCKET"       = "prod-sharedservices-media-bucket"
              + "TEAMS_WEBHOOKS_JSON" = jsonencode(
                    {
                      + animeutopia   = {
                          + auto   = "https://feedutopia.webhook.office.com/webhookb2/0ec044b6-d4fe-42b4-98f4-ca8a9b2e491e@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/15df2c60c45142c7ba181f8f344e4998/2742a55c-9d93-47f0-aed1-1965283926c0/V2Cnzgq7uVfRrUuBqjjg-PFkjf5_B3LNar_rdf3HmjIWk1"
                          + manual = "https://feedutopia.webhook.office.com/webhookb2/0ec044b6-d4fe-42b4-98f4-ca8a9b2e491e@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/782c0a472f0d49efba1a273ce2be2e99/2742a55c-9d93-47f0-aed1-1965283926c0/V2_ir389v5GI9tjXmVusULmYu9oQgKBzvwbXJ7TzK91so1"
                        }
                      + wrestleutopia = {
                          + auto   = "https://feedutopia.webhook.office.com/webhookb2/4d9dfc6f-4e46-45e9-842b-b9bb0343b83d@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/a40586b415b64e8fb9c188fc82a23559/2742a55c-9d93-47f0-aed1-1965283926c0/V2UwbSe1Rj0AKXMVwKk7dmo11nGQUrDxaAiN-DkdQVo5U1"
                          + manual = "https://feedutopia.webhook.office.com/webhookb2/4d9dfc6f-4e46-45e9-842b-b9bb0343b83d@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/370f96cc967740bfb6693ce8e343caa3/2742a55c-9d93-47f0-aed1-1965283926c0/V2XfHhkWYO3wYScaUkayH4-sJr-vp_6GAHIrKChZcwMyw1"
                        }
                    }
                )
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.render_video will be created
+ resource "aws_lambda_function" "render_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "render_video"
      + id                             = (known after apply)
      + image_uri                      = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:525b669bb0b7639587a136e6842897bbc338b40c8f9f6cbf6983b18daa42fe45"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = "arn:aws:sqs:us-east-2:825765422855:sharedservices-lambda-dlq"
        }

      + environment {
          + variables = {
              + "FFMPEG_PATH"   = "/opt/bin/ffmpeg"
              + "TARGET_BUCKET" = "prod-sharedservices-artifacts-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + file_system_config {
          + arn              = "arn:aws:elasticfilesystem:us-east-2:825765422855:access-point/fsap-076e0e4723ceab689"
          + local_mount_path = "/mnt/efs"
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.start_sfn will be created
+ resource "aws_lambda_function" "start_sfn" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/start_sfn/start_sfn.zip"
      + function_name                  = "start_sfn"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ZLdA3mnqvz+hd5D0RztEX/PouhhIUGvWOe7ULhWaLmc="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_sfn_state_machine.manual_workflow will be created
+ resource "aws_sfn_state_machine" "manual_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "manual_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::825765422855:role/sharedservices_step_functions_role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + type                      = "EXPRESS"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = "arn:aws:logs:us-east-2:825765422855:log-group:/aws/vendedlogs/states/manual_workfloww:*"
        }

      + tracing_configuration (known after apply)
    }

  # aws_sqs_queue_policy.lambda_dlq_policy will be created
+ resource "aws_sqs_queue_policy" "lambda_dlq_policy" {
      + id        = (known after apply)
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sqs:us-east-2:825765422855:sharedservices-lambda-dlq"
                      + Sid       = "AllowLambdaServiceToSendMessage"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + queue_url = "https://sqs.us-east-2.amazonaws.com/825765422855/sharedservices-lambda-dlq"
    }

Plan: 13 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 13 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```